//* V4: 商品系統別の既存ジョブに制度マスタを追加する。
//* 教材上のJCL相当記述。実行はrun-job-v04.ps1による。
//RGJOB04 JOB (NEWBUS),'REGULATION'
//NBSTEP EXEC PGM=NBASSESS
//REGDATE DD DSN=NB.REGDATE,DISP=SHR
//APPLICATION DD DSN=NB.APPLICATION,DISP=SHR
//ASSESSMENT DD DSN=NB.ASSESSMENT,DISP=NEW
// IF (NBSTEP.RC = 0) THEN
//MDSTEP EXEC PGM=MDASSESS
//REGDATE DD DSN=NB.REGDATE,DISP=SHR
//MEDICAL DD DSN=NB.MEDICAL,DISP=SHR
//MEDASSESS DD DSN=NB.MEDASSESS,DISP=NEW
// ENDIF
